<div style="background-color: lightblue;border: 2px solid gray;">
    <h2 style ="text-align:center; padding-top:5px;"> CS 101 - Foundation of Data Science and Engineering  </h2><br>
    <p style="text-align:center;padding:5px; fontt-size:14px"><b> PSET-4 - Managing Data Excercise-2 (100 pts)<b></p> <br>
</div>

### This is an individual assignment. No collaboration is allowed.

### Assignment Goal:
 
**Part-1 : Explore Pandas, perform data cleaning using Pandas.**

**Part-2 : Generate random sample data in SQL**

**Part-3 : Practice writing SQL queries**

**Start by reviewing the provided file nj_teachers_salaries_pset4.csv. Examine the column names, data types of this data file. After reviewing this file please provide your solutions for the questions below.**

**Note: The file has identical columns that you worked on PSET-3, however all the data are not identical**

**Resources:**<br>
**https://pandas.pydata.org/docs/reference/frame.html**<br>
**Module 4 & Module 5 Lectures**

**Please feel free to create new cells in your notebook for completing the assignment.**

# Part-1 (60 points)

**In this part you will be working with Pandas to explore and clean data. For each of the questions, please make sure that you show your work on what was done in each step.**

**For Example if you drop rows, be sure to show the how many rows were dropped at each step. You can use 
df.shape to show before and after count.**

**For Questions 3-5 that involve modifying your values, you need to show us few rows where the modification was done. 
As an example you are looking at df['experience_total'] column and you discover that the column has values that are not numerical. You go ahead and set the values as np.NAN.  You should show that those values were indeed set  as nan. You can use print statements or simply create a new cell and show some example rows. Please display relevant rows and not the full dataframe.**

In [29]:
import pandas as pd
import numpy as np
import mysql.connector as sq

## Question-1 (1 pts)

### Create a dataframe called df using the provided csv file nj_teachers_salaries_pset4.csv. Use df.info() to get the information about the columns, non-null values, and data type inferred by Pandas for each column. 

**Pandas tries to infer the data type of each column. However if you have a numerical column, with an invalid value (such as a string), it will infer it as an object. String values are inferred as object data type.**

In [61]:
df = pd.read_csv("nj_teachers_salaries_pset4.csv")
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100005 entries, 0 to 100004
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   id                   99998 non-null   float64
 1   last_name            100003 non-null  object
 2   first_name           100003 non-null  object
 3   county               100003 non-null  object
 4   district             100003 non-null  object
 5   school               100003 non-null  object
 6   primary_job          100003 non-null  object
 7   fte                  100003 non-null  object
 8   salary               99983 non-null   object
 9   certificate          100003 non-null  object
 10  subcategory          100003 non-null  object
 11  teaching_route       100003 non-null  object
 12  highly_qualified     100003 non-null  object
 13  experience_district  100003 non-null  object
 14  experience_nj        100003 non-null  object
 15  experience_total     99983 non-null   object
dtypes: float64(1), object(15)
memory usage: 12.2+ MB

/var/folders/14/m1yk_rm10nx5rd9pwp0n6qtc0000gn/T/ipykernel_44082/1607330085.py:1: DtypeWarning: Columns (7,8,13,14,15) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("nj_teachers_salaries_pset4.csv")

,id,last_name,first_name,county,district,school,primary_job,fte,salary,certificate,subcategory,teaching_route,highly_qualified,experience_district,experience_nj,experience_total
0,1.0,Heckman,William,Bergen,River Edge Boro,Cherry Hill School,Elementary School Teacher K-5,1.0,98774,Standard certificate,General ed,Traditional,Not highly qualified,9.0,9.0,9
1,2.0,Bird,Kelly,Bergen,Wood-ridge Boro,Catherine E. Doyle Elementary School,Art,1.0,118415,Standard certificate,General ed,Traditional,Doesnt need to be highly qualified,13.0,13.0,13
2,3.0,Aikens,Crystal A,Bergen,Emerson Boro,Patrick M Villano School,Kindergarten,1.0,57919,Standard certificate,General ed,Alternate,Doesnt need to be highly qualified,7.0,7.0,7
3,4.0,Leonard,Isaiah,Gloucester,Deptford Twp,Deptford Township High School,Elementary Kindergraten-8 Grade,0.8,107746,CEAS,Special ed,Traditional,Doesn't need to be highly qualified,26.0,26.0,26
4,5.0,Hinton,Dustin,Camden,Cherry Hill Twp,Cherry Hill High School West,English Non-elementary,0.8,54277,Standard certificate,General ed,Traditional,Doesn't need to be highly qualified,5.0,5.0,5

## Question-2 (1 pts)

### Drop rows that have all values as NaN. (Recall from lecture that you have to set the parameter how='all')

In [62]:
df.dropna(how='all', inplace=True)

## Question-3 (20 pts)

### Numerical Columns :

### Identify numerical columns excluding id column, remove any invalid characters from numerical columns by first setting it to np.NAN , and finally drop rows containing NaN values. (5))

### Set the correct data type for each of the numerical columns (i.e. int , float) (1)

## Check the id column. Set the correct id number for rows that are NA/NaN. Set the correct dtype.(5)

### At the end of this step your dataframe should not contain any invalid values for numerical values. Only invalid/missing values should have been dropped. (5)


### Please be sure to show your work, meaning , show few example rows that were actually modified. (4)   

### Note : do not reset the index of the dataframe at any point.

In [67]:
num_cols = num_cols = ["fte", "salary", "experience_district", "experience_nj", "experience_total"]

In [68]:
def clean_num(col):
    df[col] = pd.to_numeric(df[col], errors='coerce')

for col in num_cols:
    clean_num(col)

df.dropna(subset=num_cols, inplace=True)

In [69]:
int_cols = ["experience_district", "experience_nj", "experience_total"]
for col in int_cols:
    df[col] = df[col].astype(str).str.strip()  # remove spaces

# convert to numeric
df[int_cols] = df[int_cols].apply(pd.to_numeric)

# convert to integer
df[int_cols] = df[int_cols].astype(int)

In [70]:
float_cols = ["fte", "salary"]
for col in float_cols:
    df[col] = df[col].astype(str).str.strip()  # remove spaces

# convert to numeric
df[int_cols] = df[int_cols].apply(pd.to_numeric)

# convert to float
df[int_cols] = df[int_cols].astype(float)

In [74]:
# drop rows with NaN values in numerical columns
df.dropna(subset=num_cols, inplace=True)

# id column 
df['id'].fillna(method='ffill', inplace=True)
df['id'] = df['id'].astype(int)

/var/folders/14/m1yk_rm10nx5rd9pwp0n6qtc0000gn/T/ipykernel_44082/1726291065.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['id'].fillna(method='ffill', inplace=True)
/var/folders/14/m1yk_rm10nx5rd9pwp0n6qtc0000gn/T/ipykernel_44082/1726291065.py:5: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['id'].fillna(method='ffill', inplace=True)

In [72]:
print("Modified numerical column values:")
print(df[num_cols].head(10))

Modified numerical column values:
   fte    salary  experience_district  experience_nj  experience_total
0  1.0   98774.0                  9.0            9.0               9.0
1  1.0  118415.0                 13.0           13.0              13.0
2  1.0   57919.0                  7.0            7.0               7.0
3  0.8  107746.0                 26.0           26.0              26.0
4  0.8   54277.0                  5.0            5.0               5.0
5  0.5   82772.0                  1.0           20.0              20.0
6  0.8   51379.0                 39.0           39.0              39.0
7  1.0   96061.0                  1.0            1.0               1.0
8  1.0  107300.0                 22.0            1.0              24.0
9  0.8   87862.0                 15.0           15.0              15.0

## Question-4 (5 pts)

### String Columns:

### Identify string/object columns. Remove any leading and trailing spaces. This can be applied to all string columns (3)
### Show example rows/columns where leading and trailing spaces were removed.Hint : first_name,last_name have data values with leading and trailing spaces. Show at least 2 such examples where data values were modified for these columns. (2)

### No rows should be dropped.

In [ ]:
string_cols = df.select_dtypes(include=['object']).columns
df[string_cols] = df[string_cols].apply(lambda x: x.str.strip())

In [76]:
print("Example rows where spaces were removed:")
print(df[['first_name', 'last_name']].head(10))

Example rows where spaces were removed:
  first_name last_name
0    William   Heckman
1      Kelly      Bird
2  Crystal A    Aikens
3     Isaiah   Leonard
4     Dustin    Hinton
5     Robert   Richard
6       Chad    Duncan
7     Dennis  Peterson
8    Anthony     Logan
9      Jerry     Riley

## Question-5 (20 pts)

### Additional Cleaning - String Column :

### Perform additional cleaning on string columns. Remove any special/invalid characters from the string columns.

### Example :
### df['primary_job'] contains a value 'Family & Consumer Sciences â€“ Apparel, Textiles And Interiors'.

### The special character should be removed to give the value 'Family & Consumer Sciences  Apparel, Textiles And Interiors' (2.5 pts)


### Perform data cleaning on at least 3 string columns. You will have to identify data values in your string columns, and remove any special characters. (7.5) pts

### You should try to avoid setting string columns to np.NAN , and dropping it. However, it is ok if you set some rows to np.NAN and drop it for which values are completely invalid. In the end you should have approximately the same number of rows that you had after finishing Question 3. 

### We are not looking for a perfect solution. The data may still consist of invalid values. We are more interested in seeing how you have applied your learning to this assignment. 


### In all cases please show your work, meaning show us few example rows/columns where the data values were actually modified. (10 pts)

### Note : In general letters, numbers, punctuations , & , /, \, () , - , :, s'_,.,?!&/-:#@   are considered valid. You can choose to include more characters.  However, for first name and last name, teaching_route, subcategory you will want to choose only specific characters to be considered valid.

In [77]:
def clean_text(text):
    return re.sub(r'[^a-zA-Z0-9 &(),.:?!@#/-]', '', str(text))

df[string_cols] = df[string_cols].applymap(clean_text)

/var/folders/14/m1yk_rm10nx5rd9pwp0n6qtc0000gn/T/ipykernel_44082/2282228724.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df[string_cols] = df[string_cols].applymap(clean_text)

NameError: name 're' is not defined

## Question-6 (1 pts)

### Drop any duplicate rows. Display df.info() to shows the data types, and Non-Null count. 
https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop_duplicates.html

In [78]:
df.drop_duplicates(inplace=True)

## Question -7

### Save your cleaned dataframe as  cleaned_data.csv. Be sure to set the parameter index = False to avoid saving the index as an extra column

ex:
df.to_csv("cleaned_data.csv", index=False)

In [79]:
df.to_csv("cleaned_data.csv", index=False)

## Question -8

### Similar to PSET-3 

### 8.1 Connect to your MySql database using your username and password. Name the cursor returned from the mysql connection object as mycursor. (1 pts)


### 8.2 Use the same database as PSET-3 nj_state_teachers_salaries, or if you have deleted it create a database called nj_state_teachers_salaries


### 8.3 Create a table called teachers_salaries_pset4 with all the columns in your cleaned_data.csv. For this part ,be sure to use appropriate data type for all the columns.  If you are facing difficulty creating a column with Float or bool or int , it is ok to store it as TEXT. (MAX 2 allowed for numerical columns being stored as TEXT) (3 pts)


### 8.4 Using LOAD DATA statement (as discussed in Module 4 lectures) load the data from cleaned_data.csv to your table created in 8.3. Use of OPTIONALLY ENCLOSED BY  clause and TERMINATED by clause is recommended. (3 pts)

In [86]:
mydb = sq.connect(
    host="localhost",
    user="root",
    password="idp/dt=[H,p]",
    allow_local_infile=True, 
    database="nj_state_teachers_salaries"
)
mycursor = mydb.cursor()

In [87]:
create_table_query = """
CREATE TABLE IF NOT EXISTS teachers_salaries_pset4 (
    id INT PRIMARY KEY,
    last_name VARCHAR(255),
    first_name VARCHAR(255),
    county VARCHAR(255),
    district VARCHAR(255),
    school VARCHAR(255),
    primary_job VARCHAR(255),
    fte FLOAT,
    salary FLOAT,
    certificate VARCHAR(255),
    subcategory VARCHAR(255),
    teaching_route VARCHAR(255),
    highly_qualified VARCHAR(255),
    experience_district INT,
    experience_nj INT,
    experience_total INT
);
"""
mycursor.execute(create_table_query)

In [88]:
load_data_query = """
LOAD DATA LOCAL INFILE 'cleaned_data.csv'
INTO TABLE teachers_salaries_pset4
FIELDS TERMINATED BY ','
OPTIONALLY ENCLOSED BY '"'
LINES TERMINATED BY '\n'
IGNORE 1 ROWS;
"""
mycursor.execute(load_data_query)
mydb.commit()

In [89]:
mycursor.execute("SELECT COUNT(*) FROM teachers_salaries_pset4")
print(f"Number of rows in table: {mycursor.fetchone()[0]}")

Number of rows in table: 99954

### Question 9 - For this question you are only required to run the cells. To get credit  your code from Question 8 must have been successfully run, and executed. No credit will be awarded if data was loaded using MySQL workbench.

## Question 9 (5 pts)

Run the 2 cells below. The code checks if all the data rows and columns were stored in the database. 

The code below assumes that you named your cursor object as mycursor(As specified in Question-8). If you named it differently, you can rename mycursor to match the variable name.

In [90]:
cmd = "select count(*) from \
                 nj_state_teachers_salaries.teachers_salaries_pset4 "
mycursor.execute(cmd)
count = mycursor.fetchone()[0]

print(f"Number of rows in teachers_salaries table : {count}")

Number of rows in teachers_salaries table : 99954

In [91]:
cmd = """SELECT COUNT(*) \
                FROM INFORMATION_SCHEMA.COLUMNS \
                WHERE table_schema = 'nj_state_teachers_salaries' \
                AND table_name = 'teachers_salaries_pset4'"""
mycursor.execute(cmd)
count = mycursor.fetchone()[0]
print(f"Number of columns in teachers_salaries table : {count}")

Number of columns in teachers_salaries table : 16

# End of Part-1

### For both Part-2 and Part-3 you will need to work on MySQL workbench. For both parts you must submit .sql files. More information below.

# Part-2 (10 pts)

**For this part you will generate a random sample data from the table you created in Part-1 and save it as a csv file. Generating random samples have many use cases in the real world. For example, you are a developer who is working on a software application that requires access to a critical database. Instead you maybe given only a sample of data to work with to develop your application. Another use case is bootstrapping in statistics, or when you test your models with samples of data.**

## Question 1 (8 pts)

### Use a SELECT statement to generate and output a random sample to : 
### Include all columns 
### Include field (column) headings 
### Randomly select 777 records with a seed value of 7 
### Output results to a csv file named sample.csv 
### save your sql as  output.sql . You will submit this file as a part of this assignment. 

**You will find module 5 lecture on SQL Random Sample Generation useful**

## Question 2 (2 pts)

### Create a dataframe using sample.csv generated from Question-1. Display the first 5 rows, and last 5 rows. Print the shape of the dataframe.

In [ ]:
#your code here

# Part-3 (30 pts)

**For this part you will work on sql queries. You will write your queries for the provided dataset teachersample.csv. We could have asked you to write the queries based on the existing table nj_state_teachers_salaries.teachers_salaries_pset4 , however everyone's data cleaning process will be different resulting in different dataset.** 

**All work need to be done in MySQL workbench**

## Question 1

### Create a table called salaries within the nj_state_teachers_salaries database. Load the data in to the table from the provided file teachersample.csv. The teachersample.csv does not contain the id column. Please modify your code to work with this csv file. 

### You don't need to submit the code for this. This table is intended only for queries in Question-2.

## Question 2 (30 pts)
## Each query is worth 3 pts.

### Write the following queries in MySQL workbench, and name the file queries.sql.  The file you submit should have the exact name for you to get credit. We will run your query, so you don't need to capture the output. The file should include only the 10 queries. Be sure to test it before submission. 

**Example Query for your reference:**

**select count(*) from nj_state_teachers_salaries.salaries;**

#### Note : Please include the name of the database and the table in each query as shown in the above example. End each query with a semicolon as shown in example.Your file queries.sql should be able to execute any any machine that has the nj_state_teachers_salaries database and the salaries table.  We will deduct upto 10 pts if queries.sql does not execute.

### 1. Calculate the average salary

### 2. Calculate the number of people whose salary is more than 150,000.

### 3. Get the last name of the ones who make more than 150,000 but have less than 5 years of total experience

### 4. Get the highest salary for Preschool, School Counselor, Principal (anyone with the word Principal in the title), School Psychologist, and Kindergarten. (These are individual queries.  You should have 5 separate queries.)

### 5. Get the last name, first name, and salary of the lowest earner who works in Atlantic City

### 6. Get the total number of employees working in Passaic City with more than ten years of total experience.

## Submission on Gradescope

**Gradescope canvas left menu -> Gradescop -> PSET 4: Managing Data Excercise 2**

**Submission :**

**Part -1  : This jupyter notebook, and a pdf of this notebook.** 

**Part -2 : output.sql and sample.csv**

**Part -3 :  queries.sql containing all your queries.  This file should only include the sql queries. Please don't include the code that created the salaries table.** 



**To create a pdf of this notebook :  In your browser open print, and save as pdf. Name the pdf LastNameFirstName.pdf
example: DoeJohn.pdf**

**Name this jupyter notebook with the same format LastNameFirstName.ipynb**


**Make sure that your notebook has been run before creating pdf. Any outputs from running the code needs to be clearly visible. We need all the files from Part-1, Part-2, and Part-3 to assign you grades.** 


**Drop all the files in gradescope under PSET 4: Managing Data Exercise 2.**

### Submission Note (Please read)

**After submitting your files on Gradescope , You may an error that says**

**"The autograder failed to execute correctly. Contact your course staff for help in debugging this issue. Make sure to include a link to this page so that they can help you most effectively."**

### You don't have to take any action , and you do not need to contact us. The error is beacuse of some internal setup on Gradescope. As long as you have followed the specs, and submitted all the required files, you are good.